Repository: kotlarekm/DemoWall
Catalog: Logical/mappView/Visualization/Resources/Texts/InfoDialogContentStrings.tmx
Source language: en
Languages: pl

source: Coupling information
pl: Informacje o sprzęganiu

source: Gear coupling
pl: Przekładnia

source: Cam coupling
pl: Krzywka

source: Mixer primary - master axis
pl: Mixer główny - oś główna

source: Mixer secondary - slave axis
pl: Mixer poboczny - oś podrzędna

source: This function brings the slave axis in the specified velocity ratio to the master axis. As long as the "Coupling Established" output is not set, the master axis is only allowed to move in the positive direction (Right). Once it has been set, the master can move in any direction.
pl: Ta funkcja ustala oś podrzędną w określonym stosunku prędkości do osi głównej. Dopóki nie jest ustawione wyjście „Sprzęganie ustalone”, oś główna może poruszać się tylko w kierunku dodatnim (Prawo). Po tym jak zostanie ustawione oś główna może poruszać się w dowolnym kierunku.

source: This function starts a cam coupling between the master and slave axes. Enabling cam coupling is only possible when the master reaches the "MasterOffset" position (0°). To reach "MasterOffset", the master axis is only permitted to move in a positive direction (Right).
pl: Ta funkcja uruchamia sprzężenie krzywkowe pomiędzy osią główną i podrzędną. Włączenie sprzężenia krzywkowego jest możliwe tylko wtedy, gdy oś główna osiągnie pozycję „MasterOffset” (0°). Aby osiągnąć „MasterOffset”, oś główna może poruszać się tylko w kierunku dodatnim (Prawo).
